sae/sae-webservices-client-demo/src/test/resources/request/pingSecure.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsse:Security
         xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"
            ID="3f8f9cec-49c5-46e8-ad3f-ee60c877571e" IssueInstant="2011-04-14T08:40:30.133Z"
            Version="2.0">
            <saml:Issuer>TEST_SERVICES_WEB_SAE</saml:Issuer>
            <saml:Subject>
               <saml:NameID
                  Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified">NON_RENSEIGNE</saml:NameID>
               <saml:SubjectConfirmation
                  Method="urn:oasis:names:tc:SAML:2.0:cm:bearer">
                  <saml:SubjectConfirmationData
                     NotOnOrAfter="2011-04-14T09:40:30.040Z" Recipient="urn:URSSAF" />
               </saml:SubjectConfirmation>
            </saml:Subject>
            <saml:Conditions NotBefore="2011-04-14T07:40:30.040Z"
               NotOnOrAfter="2011-04-14T09:40:30.040Z">
               <saml:AudienceRestriction>
                  <saml:Audience>http://sae.urssaf.fr</saml:Audience>
               </saml:AudienceRestriction>
            </saml:Conditions>
            <saml:AuthnStatement AuthnInstant="2011-04-14T08:40:30.133Z"
               SessionIndex="3f8f9cec-49c5-46e8-ad3f-ee60c877571e">
               <saml:AuthnContext>
                  <saml:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:unspecified
                  </saml:AuthnContextClassRef>
               </saml:AuthnContext>
            </saml:AuthnStatement>
            <saml:AttributeStatement>
               <saml:Attribute Name="PAGM">
                  <saml:AttributeValue>ROLE_TOUS</saml:AttributeValue>
               </saml:Attribute>
            </saml:AttributeStatement>
         </saml:Assertion>
      </wsse:Security>
      <wsa:To>http://localhost:8082/axis2/services/SaeService/</wsa:To>
      <wsa:MessageID>urn:uuid:DE8886B20CC7EABCB11302770429755
      </wsa:MessageID>
      <wsa:Action>PingSecure</wsa:Action>
   </soapenv:Header>
   <soapenv:Body>
      <ns1:PingSecureRequest xmlns:ns1="http://www.cirtil.fr/saeService" />
   </soapenv:Body>
</soapenv:Envelope>