sae/sae-webservices/src/test/resources/request/pingsecure_failure_accessDenied.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   
   <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      
      <wsse:Security
         xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
         xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         
         <saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" ID="73aad763-a134-4bca-a01c-b33093b1ccb5" IssueInstant="2011-04-14T13:52:43.130Z" Version="2.0"><saml2:Issuer>issuer_test</saml2:Issuer><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#73aad763-a134-4bca-a01c-b33093b1ccb5"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>h4codTyCe91jIHNMIc+JIxLS0R8=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>hmoxV29WfDjBwOBhDVgRudfmHKzu30CkO+6PGysRSh1gd/aIeLVEpjhg0nRNZdhJn77w1T8ccIF1GGaEN8xKu96PKFBgJ33hakHsDq1gh97MocftuoHOjRvHVr2Cemi/MmVmJ7W72pVEBJnVnlj+0x1JTBkHNEVv+qAv+RV6NthWC5nmQXbdtV4GVzeEUygn4/6rY2aMrx+xLm+/MnZ+moaa5+77YOMl6C7hqaHRrSBidNTooIK32jc6BJXLW3qa8HHVPm65febGNMNmklXOVKfuGXSyXoDfxogkKjnNWkAHkdCNNRsG9prlHMgkSvIsye9IoRYEMUmN3RnlBYQ4tIPhnyD+NAR+t3mTspCW2sWs90S764KrjFbPl2l4wjqcGVrjWdiRLq9JDX9txdvZ5FlTLu6wc9yqTZ4tQDOwgQW6qouX5Ziv3Mvh79xBm3hzXTSiQkacDXa8MG49egXvSRtb92SDQDmLhJHCwyNnlcLALAK6OaFMM3TY0Vc0GZID1dQpYo1YbQQWU+R+nlKs59YEj8P7czUiTq8wlOhDFKmpJSnIzfE7kLeSoLCNkgrJvbyj5CC7/iF2UTW6kAbPQ/WC8oVCI87Z0lrJ3L7efcZSvRD7U9MW32GAt2l7As0JNrS+QnzrtLwitW1/WKg8IhJDs4e6rbGWBjsvD82ASMU=</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIIE6TCCA9GgAwIBAgIBJjANBgkqhkiG9w0BAQUFADBYMQswCQYDVQQGEwJGUjEPMA0GA1UECAwG
         RnJhbmNlMQ4wDAYDVQQHDAVQYXJpczEOMAwGA1UECgwFQUNPU1MxGDAWBgNVBAMMD0FDIEFwcGxp
         Y2F0aW9uczAeFw0xMTAyMjEwODE1NTlaFw0yMDA0MTIxNTU5MjJaMG0xCzAJBgNVBAYTAkZSMQ8w
         DQYDVQQIDAZGcmFuY2UxDjAMBgNVBAcMBVBhcmlzMQ4wDAYDVQQKDAVBQ09TUzEVMBMGA1UECwwM
         QXBwbGljYXRpb25zMRYwFAYDVQQDDA1Qb3J0YWlsIEltYWdlMIICIjANBgkqhkiG9w0BAQEFAAOC
         Ag8AMIICCgKCAgEA7SNRQAcbHZ/0njf4lfrUinuFzye2BEAkzYLygYM00t4A5nq7XCLby94Ix2G6
         UEXPrk80sWi2eABq85YydfIrd75n85R4p075O9SwaH6b2EvxLmawuN3rsc3ppckZ7o/2Qy2oQWHI
         YlB+jkTFpT8olMprZDZkxhbRtosZGwUUEq3KsMfJ3R7rIE8WKhY1koO4onla12fANOJzrYxa5rNo
         kmigshsmqa8coReT/dndzdO4P4J/dormNxaUSz/zfLThELji+YeQ5aOcjBL81Gv3yOBS40/Y9/lr
         qL3nHzN52A+hDN6gDGrU9OwWgPC5SG1lYyqoYEEBpBsZuDyAdY2PxbdfAQ9THBEaXKgNKeqdimvp
         uyHmaJez8WFAwDyKJYNWQcrM3a8EKj6Q5lSZSP2xQUq7CgYrl5WrI8Pio4OdpgXxCZEJngHrA8FR
         /rvTZTnbFKlxMHvLQz/8BuS8Ml+f+VrNkBG/pucAfKBbPR0wliz7aeGpbmR8hwb/eSkdBM/B86El
         OR5s0wsNSIzdlGY9UThNyAYtMvolabBnHdLKoKnRupoXlZUOz3EGt1UkzCrMwzkUx3+/M1XxD9zg
         0JUaT6PXv+Zaf9nv1k166aBCmIf9eGYLPL+8kyvRPYkOp2KBNv88I4WXHzyJbYuMzoY3Bo6cYt7R
         hkEqpoUTTyUTK5sCAwEAAaOBqDCBpTAdBgNVHQ4EFgQUS4SJ/SXAEAA3GYlT+Vjh8FiCGnswHwYD
         VR0jBBgwFoAU9PcH/3852zWmAmtzDPRCjmLLmcwwEQYJYIZIAYb4QgEBBAQDAgbAMB0GA1UdJQQW
         MBQGCCsGAQUFBwMCBggrBgEFBQcDATALBgNVHQ8EBAMCBaAwJAYDVR0RBB0wG4EZcGF1bC5tYXJl
         Y2hlQGNlcjY5LnJlY291djANBgkqhkiG9w0BAQUFAAOCAQEAsYUAMW3Dt5kczcST6k/hj79ZDIhH
         3LRQs7Nf4U8cbuCBzb1Aa5GrojkDHaW18cX4Ez3o2HFI5trEd3xzHXtnyzRyp+EWW+H4huh2DHEL
         uvSvCpxYE/DxynK8sVg41NVFG5TZvf9bz8P9qC7IiXfh1M2E/RvGoH4m1X7cXjsWw7m5HKqihh91
         7QfXpiOwF2DgzO1kaj76pFq6OI2X21lFvWYlHGRmV+sOhsUbWi1yEEOnYSq6uJvGNhDbhb6wNO9/
         c7gb6t90gt3e6T3AaEcM2MKsuIl1gO5EAIpeyIEW4VB8+sq2SF3RvNcf+Z5semVft+JgBPE1yZNv
         rzn8vssffQ==</ds:X509Certificate><ds:X509Certificate>MIID+DCCAuCgAwIBAgIBATANBgkqhkiG9w0BAQUFADBfMQswCQYDVQQGEwJGUjEPMA0GA1UECAwG
         RnJhbmNlMQ4wDAYDVQQHDAVQYXJpczEOMAwGA1UECgwFQUNPU1MxHzAdBgNVBAMMFkFDIFJlY291
         dnJlbWVudCBSYWNpbmUwHhcNMTAwNDE1MTYwMzEwWhcNMjAwNDEyMTU1OTIyWjBYMQswCQYDVQQG
         EwJGUjEPMA0GA1UECAwGRnJhbmNlMQ4wDAYDVQQHDAVQYXJpczEOMAwGA1UECgwFQUNPU1MxGDAW
         BgNVBAMMD0FDIEFwcGxpY2F0aW9uczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAMjf
         q+OYpckuhO10ixz5WjeuPm8lI9fFEPivCOoa1DawJHoHa/XUIuNxZm1j6vKAEE5w6hbAvV6ztwpI
         bgnTlnbJWfZoUM7ohwPGl1B3x2nRyNC1Dl4j9/Fda73bPrPZpWLC8HugYb34PxALfeirgEeR6Y7G
         E5HzSXlmB4bNTYXiSPXtaTuYWcXBO4cUsj6cDv9aWE0wf4NN+tctVtT9qlGlAaLW4M0hKdpzkpqG
         JlpNY7RnC0BNojece0OgmdRIe0AwSXu0/hNKG5jnnguwzrFTSwl/zmp7ZYERSIn/sMkZodQfzWw5
         u0N36gZsBzLFQPyQTpWf0QsyuU1KYN1D6jUCAwEAAaOBxTCBwjAPBgNVHRMBAf8EBTADAQH/MB0G
         A1UdDgQWBBT09wf/fznbNaYCa3MM9EKOYsuZzDAfBgNVHSMEGDAWgBQaGScPA/kpHjPFNAV/c2yL
         fhH7szAYBgNVHSAEETAPMA0GCysGAQQB/3iHaAEBMA4GA1UdDwEB/wQEAwIBBjBFBgNVHR8EPjA8
         MDqgOKA2hjRodHRwOi8vY2VyNjlpZHhwa2l2YWwxLmNlcjY5LnJlY291di9Qc2V1ZG9fQXBwbGku
         Y3JsMA0GCSqGSIb3DQEBBQUAA4IBAQA/xpYbpXyA6ppTE0uAKVpoVyoXpYV+1hmGPzrE1XHd+4C0
         rLXHO1Q9Oyz1+NefcOoNX58cdJKTc38H0WxqyM1elFRrakIw+PVfX63PkrAkYZSnI9DKj39/8DJU
         QPLJu6owxyVD+WrpTz377U1v+GF36kIqMFgpI9Y61stbsoOJfKiTs1tSvuH2IILFh7zW1vGmdHFy
         9QaTmgIcsbKpUR40iwiXNfjcCPucms6JQICLZT0T0aeiGf82lHL7/+6AnXXTPwjNAS74RjQJyYTs
         J/anA7GfERXWTgM1OSr16HNUvQTntqsvRNC96XTk1+EYA40UrSsLSJamKBphPYQeAcRX</ds:X509Certificate><ds:X509Certificate>MIIEADCCAuigAwIBAgIBATANBgkqhkiG9w0BAQUFADBgMQswCQYDVQQGEwJGUjEPMA0GA1UECAwG
         RnJhbmNlMQ4wDAYDVQQHDAVQYXJpczEQMA4GA1UECgwHUE0vU0dETjEOMAwGA1UECwwFRENTU0kx
         DjAMBgNVBAMMBUlHQy9BMB4XDTEwMDQxNTE1NTkyMloXDTIwMDQxMjE1NTkyMlowXzELMAkGA1UE
         BhMCRlIxDzANBgNVBAgMBkZyYW5jZTEOMAwGA1UEBwwFUGFyaXMxDjAMBgNVBAoMBUFDT1NTMR8w
         HQYDVQQDDBZBQyBSZWNvdXZyZW1lbnQgUmFjaW5lMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIB
         CgKCAQEAltWThsQoDJf5B3KgConIWKR1c+4mm2eNpPGHIesE8CUmYhI5X7wa6Ezlx5eCJriVRhLL
         024BCDu0R2g2HV4wMEcMADb8vZ7/uVsKhot9r0Sp/ASlRzg7EdquN5QprfGrbXN5l0TdqtvoTFAU
         vPgKqRHnuYj6D6HKaWpNM6K653DN2ie5hGa/NzyZxkGhCU9cyt9Y+pOyY3Vs3pSxIjQ/XfDsiIjJ
         JNonnq1OBsK8GPQlxlVm6QY16wbZ2TuvSXCxn3elQF6qiHB9p1VtUylUobFY4jXO/a6DfR699FVZ
         kB+go6U0mzrnHe6jckdr1LSABII9+8OkjUhJduvt4Moa9wIDAQABo4HFMIHCMA8GA1UdEwEB/wQF
         MAMBAf8wHQYDVR0OBBYEFBoZJw8D+SkeM8U0BX9zbIt+EfuzMB8GA1UdIwQYMBaAFA/V51UsBjLM
         m8gq6U3DaNB59qnJMBgGA1UdIAQRMA8wDQYLKwYBBAH/eIdoAQEwDgYDVR0PAQH/BAQDAgEGMEUG
         A1UdHwQ+MDwwOqA4oDaGNGh0dHA6Ly9jZXI2OWlkeHBraXZhbDEuY2VyNjkucmVjb3V2L1BzZXVk
         b19BQ09TUy5jcmwwDQYJKoZIhvcNAQEFBQADggEBAIl7Tu0FPoJguOFCVcQ5nKDBSSQWWwaoNMJS
         yM0hIAp1idGKBH6MU8rX28CL10eT/vawjXrWBXrDr4OBZaPwgBVcXoOEinB+PkAOmIPPYWG4WjC0
         XohqjsLt13aVzmjkaubxJuM5TBjwGv/IeSAh2bvsOgfZOxGwoGQm/baZRUjOrk6wfzOd/670FTC4
         JAp65cgfMKV/Y78MJonnb1SePYp3678/e3C/s9TrRtg500gXprmk6RyLbhqhVF7WZo0i5Vgf8fAl
         rtUUOFXg5prBg106GgKjor4sDW4XxTXQ2QAjQzLuG9G9I+hPIbHvpnIULz+SfHnt+c4iFeCQec3S
         xoU=</ds:X509Certificate><ds:X509Certificate>MIIDtTCCAp2gAwIBAgIBADANBgkqhkiG9w0BAQUFADBgMQswCQYDVQQGEwJGUjEPMA0GA1UECAwG
         RnJhbmNlMQ4wDAYDVQQHDAVQYXJpczEQMA4GA1UECgwHUE0vU0dETjEOMAwGA1UECwwFRENTU0kx
         DjAMBgNVBAMMBUlHQy9BMB4XDTEwMDQxNTE1NTA0N1oXDTIwMTAxNzE1NTA0N1owYDELMAkGA1UE
         BhMCRlIxDzANBgNVBAgMBkZyYW5jZTEOMAwGA1UEBwwFUGFyaXMxEDAOBgNVBAoMB1BNL1NHRE4x
         DjAMBgNVBAsMBURDU1NJMQ4wDAYDVQQDDAVJR0MvQTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCC
         AQoCggEBAOj/udIRj5ESUQ6Oxz4AxqMeFR7Cvesuk6DJYWNwBSBYcjYHzR+VnQPcbIgzIPrLCrN3
         HMTU/jqJs0UX+RFNc/uQh2QkIt5Z/wenTWFkogG3ml9toyQr4csiYnhDW9nZvLy5TTOK6ZgrPuz/
         L06i6glLBIFCc9p3jI9hUqp0vpOq6QWv8nVA5FDGHOVSxH68cfrwgoV80gtuDApWm0hFpE8jKqXU
         CYCKB1+mpE2qlG1GzRWvdCl3PTo60by8lCIppP2s+bGkwLsWR/RMXT7ck2FBuitvZpoYztk4N/fO
         n0EHBHIGVkCQ5+z/++lHKlj+jcGVLbn+o7VYzS2WGV8yAk0CAwEAAaN6MHgwDwYDVR0TAQH/BAUw
         AwEB/zAdBgNVHQ4EFgQUD9XnVSwGMsybyCrpTcNo0Hn2qckwHwYDVR0jBBgwFoAUD9XnVSwGMsyb
         yCrpTcNo0Hn2qckwFQYDVR0gBA4wDDAKBggqgXoBeQEBATAOBgNVHQ8BAf8EBAMCAQYwDQYJKoZI
         hvcNAQEFBQADggEBAGI38BlvnT2U8PaIFl9a7d/BIeAcZ/RWkbkIwWtg1pQmL2Mq9+PUK5tD07S8
         +s6Y1xyMqyaIJn1yyxfHAy6i1Aaa7OwbzoxpD8cb3K1TZHGlfAShxUItDBPPjQUwswwQ7FIVMMB4
         a89btbuIzMaRaICyuoRgtHPyVeRF3iyAPgfEFeOjJ0Jrf8yPDMAJg5K7pml7Q8/WlnQUreHbymFV
         Lrg/zQ2Q1JVQ4jsy2wHY81nBJWI+APK1A5da1Z2/hmzQiiz9BxqFgIqkV/oGIkfzit32xNuQrqYH
         br17DLXoWNZ+R0uwDmFPBsFihydnOviwR1KD1nYqUTuw97ZKNtaNP1w=</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature><saml2:Subject><saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified">idUtilisateur_test</saml2:NameID><saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"><saml2:SubjectConfirmationData NotOnOrAfter="2099-12-31T23:00:00.000Z" Recipient="urn:URSSAF"/></saml2:SubjectConfirmation></saml2:Subject><saml2:Conditions NotBefore="2011-02-28T23:00:00.000Z" NotOnOrAfter="2099-12-31T23:00:00.000Z"><saml2:AudienceRestriction><saml2:Audience>http://sae.urssaf.fr</saml2:Audience></saml2:AudienceRestriction></saml2:Conditions><saml2:AuthnStatement AuthnInstant="2011-04-14T13:52:43.130Z" SessionIndex="73aad763-a134-4bca-a01c-b33093b1ccb5"><saml2:AuthnContext><saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:unspecified</saml2:AuthnContextClassRef></saml2:AuthnContext></saml2:AuthnStatement><saml2:AttributeStatement><saml2:Attribute Name="PAGM"><saml2:AttributeValue>ROLE_INCONNU;FULL</saml2:AttributeValue></saml2:Attribute></saml2:AttributeStatement></saml2:Assertion>
         
         <wsse:SecurityTokenReference wsu:Id="token1" wsse:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-tokenprofile-1.1#SAMLV2.0">
            <wsse:KeyIdentifier wsu:Id="token1" ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">
               73aad763-a134-4bca-a01c-b33093b1ccb5
            </wsse:KeyIdentifier>
         </wsse:SecurityTokenReference>
      
      </wsse:Security>
         
   </soapenv:Header>
      
   <soapenv:Body>
      <ns1:PingSecureRequest xmlns:ns1="http://www.cirtil.fr/saeService" />
   </soapenv:Body>
   
</soapenv:Envelope>